МедПредыМобильные/src/Documents/Мероприятие/Мероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Мероприятие</name>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

МедПредыМобильные/src/Enums/ПрофилиМобильногоПриложения/ПрофилиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрофилиМобильногоПриложения</name>
  <enumValues>
    <name>Супервайзер</name>
  </enumValues>
  <enumValues>
    <name>МедПредставитель</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Documents/Мероприятие/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		Объект.Проект = Константы.ТекущийПроект.Получить(); 
		Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
			Сообщить("Не задан проект на рабочем столе!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияСервер.УстановитьЗаголовокФормы(ЭтаФорма, НСтр("ru='Мероприятие "+Объект.Проект.Наименование+"';en='Meeting'"));
	
	Если Константы.ПрофильМобильногоПриложения.Получить() = Перечисления.ПрофилиМобильногоПриложения.МедПредставитель Тогда
		Элементы.Ответственный.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = Объект.Проведен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменилосьМероприятие", Объект);
	
КонецПроцедуры

&НаСервере
Функция ПередЗакрытиемНаСервере()
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Возврат НЕ ОбъектДокумента.ПроверитьЗаполнение();
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/Wiki");
	
КонецПроцедуры
